
alter table dwd.user_action_log_detail drop  partition(dt='20241110');
insert into table dwd.user_action_log_detail partition(dt='20241110')
(create_time,member_level_id,gender,city,job,guid,url,event_id,action_time,properties)
values

    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"event_x",10000,str_to_map('','_',':')                ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page101/',"page_load",20000,str_to_map('flag:BAIDU','_',':')                ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"event_t",30000,str_to_map('','_',':')                ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page101/',"page_load", 40000,str_to_map('flag:XHS','_',':')    ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"event_x",50000,str_to_map('','','')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"event_x",60000,str_to_map('','','')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page101/',"page_load",70000,str_to_map('flag:XHS','_',':')         ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"event_x",80000,str_to_map('','','')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page101/',"page_load",90000,str_to_map('flag:SITE_MSG','_',':')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"add_cart",91000,str_to_map('','','')                 ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page101/',"page_load",92000,str_to_map('','','')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"event_x",93000,str_to_map('','','')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"order_submit",94000,str_to_map('','','')             ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page101/',"add_cart",95000,str_to_map('','','')                  ),
    ('2024-11-10 08:32:28',1,1,'九江','化妆师',1,'/page/y/',"order_pay",96000,str_to_map('','','')                ),

    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_x",10000,str_to_map('','_',':')                ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",20000,str_to_map('flag:SITE_MSG','_',':')                ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_t",30000,str_to_map('','_',':')                ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load", 40000,str_to_map('flag:AD_X','_',':')    ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_x",50000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_x",60000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",70000,str_to_map('flag:XHS','_',':')         ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_x",80000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",90000,str_to_map('flag:SITE_MSG','_',':')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"add_cart",91000,str_to_map('','','')                 ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",92000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_x",93000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"order_submit",94000,str_to_map('','','')             ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"add_cart",95000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",98000,str_to_map('flag:XHS','_',':')         ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page/y/',"event_x",99000,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",99600,str_to_map('flag:SITE_MSG','_',':')),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"add_cart",99700,str_to_map('','','')                  ),
    ('2024-11-10 18:35:26',1,0,'无锡','程序员',2,'/page101/',"page_load",99600,str_to_map('flag:XHS','_',':'))   ;

-- 检查数据

select  create_time,member_level_id,gender,city,job,guid,url,event_id,action_time,properties from dwd.user_action_log_detail where dt='20241110';