-- 建表 - 拉链表，正式流程中，应该是 datax同步到ods的增量表，然后加工到拉链表
DROP TABLE IF EXISTS `dim.cms_video_scd`;
CREATE TABLE `dim.cms_video_scd` (
     `id`             int      -- 视频id
    ,`video_name`     string   -- 视频标题
    ,`video_type`     string   -- 视频类型
    ,`video_album`    string   -- 视频专辑
    ,`video_author`   string   -- 视频作者
    ,`video_timelong` bigint   -- 视频时长
    ,`create_time`    timestamp  -- 视频发布时间
    ,`update_time`    timestamp  -- 数据更新时间
    ,`start_dt`        string   -- 拉链起始日
    ,`end_dt`          string   -- 拉链结束日
)
    PARTITIONED BY (dt string)
STORED AS orc
TBLPROPERTIES(
 'orc.compress' = 'snappy'
);



-- 插入测试数据
INSERT INTO `dim.cms_video_scd` partition(dt='20241110') VALUES
('1', '常年喝咖啡对身体的损害', 'healthy', '咖啡与健康', '雀巢特约', '600', '2022-12-11 15:25:28', '2022-12-11 15:25:28','2024-10-08','9999-12-31'),
('2', '经常喝咖啡的好处', 'healthy', '咖啡与健康', '雀巢特约', '680', '2022-12-11 15:25:28', '2022-12-11 15:25:28','2024-10-08','9999-12-31'),
('3', '喝咖啡的一个误区，不了解可能深受其害', 'healthy', '咖啡与健康', '雀巢特约', '500', '2022-12-11 15:25:28', '2022-12-11 15:25:28','2024-10-08','9999-12-31'),
('4', '如何挑选一款性价比高的固态硬盘', 'it', '硬盘选购', '希捷特约', '1200', '2022-12-11 15:25:28', '2022-12-11 15:25:28','2024-10-08','9999-12-31'),
('5', '希捷最新迷你硬盘全方位评测', 'it', '硬盘选购', '希捷特约', '1200', '2022-12-11 15:25:28', '2022-12-11 15:25:28','2024-10-08','9999-12-31'),
('6', '娜姐教你辨别培训机构好坏', 'train', '多易科普', '娜姐', '2400000', '2023-06-06 16:37:33', '2023-06-06 16:37:35','2024-10-08','9999-12-31');

